#Εργαστήριο ΛΣ 1 / Ασκηση 2 / 2022 
#Ονοματεπώνυμο: Δημήτριος  Θεοδωρόπουλος

#
#
# Ερώτηση 5
#Γράψτε ένα script, με όνομα mfproc και δυνατότητα εισαγωγής 0, 1 ή 2 #παραμέτρων ως εξής: Όνομα mfproc Εμφανίζει πληροφορίες για διεργασίες με #την εξής μορφή: Name PID PPID UID GID State Συνοπτικά mfproc [-u #username] [-s S|R|Z] -u username Ορίζει τον χρήστη του οποίου τις διεργασίες #πρέπει να εμφανίσετε στο standard output. Αν δεν δοθεί, θα εμφανίσετε όλες τις #διεργασίες του ΛΣ -s state Ορίζει την κατάσταση των διεργασιών που πρέπει να #εμφανίσετε στο standard output. Μπορεί να είναι οτιδήποτε μεταξύ των #Running(R), Sleeping (S), Zombie (Z). Αν δεν δοθεί, τότε θα εμφανίσετε όλες τις #διεργασίες που βρίσκονται σε οποιαδήποτε από τις τρεις καταστάσεις #Επιστρεφόμενη τιμή 0 Δεν υπήρξε λάθος 1 Δεν υπάρχει ο χρήστης 2 Δεν #υπάρχει διεργασία σε αυτή την κατάσταση.
#Απάντηση: Αρχικά κοιτάω αν υπάρχει ο χρήστης αλλιώς εμφανίζω όλες τισ #διεργασίες. Έπειτα κοιτάω αν το 2ο ορισμα υπάρχει αλλιώς εμφανίζω τις #εντολές του χρήστη χωρίς κάποιο παραπάνω flag. Αν υπάρχει το 2ο #ορισμα τότε χρησιμοποιώ το awk για να βρω ποια και ποσά processes #υπάρχουν με την εντολή awk όπου κοιτάω αν η πρώτη στήλη (που έχουν #χωριστεί με το State, command) είναι ίση με το δεύτερο ορισμα (πχ το S). 
#Αν είναι τότε εμφανίζω όλη την γραμμή.
#Ύστερα εμφανίζω με το wc -l ποσες γραμμές υπάρχουν έτσι ώστε να #ελέγξω αν υπάρχουν processes αλλιώς εμφανίζω αντίστοιχο μήνυμα.




#!/bin/bash
if id "$1" >/dev/null 2>&1; then
     if [ "$2" ]; then
        ps -u $1 -e -o stat,command | awk '{if($1=="'$2'") {print $1 $2 $3 $4 $5 $6 $7}}'
        result=$(ps -u $1 -e -o stat,command | awk '{if($1=="'$2'") {print $1 $2}}' | wc -l | tail -n 1)
        echo $result
       if [ $result -eq 0 ]; then
           echo "No processes found with this state"
         exit 2
       fi
    else
        ps -u $1 -e -o stat,command
     fi
else
    echo "User not found"
    ps
    exit 1
fi